posts/php-note/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>PHP Note | Warren Liu</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://example.com/posts/php-note/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../programming-note/" title="Programming Notes" type="text/html">
<link rel="next" href="../microservices-note/" title="Microservices Note" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="PHP Note">
<meta property="og:url" content="https://example.com/posts/php-note/">
<meta property="og:description" content="Enable xdebug with hhvm/nginx on remote host


In order to enable remote debug, the debug machine (developer machine)
need to be accessible directly from the xdebug server. Xdebug, when inited from
th">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-14T00:00:00+01:00">
<meta property="article:tag" content="php">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">Warren Liu</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">PHP Note</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Warren Liu
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-07-14T00:00:00+01:00" itemprop="datePublished" title="2017-07-14 00:00">2017-07-14 00:00</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Enable xdebug with hhvm/nginx on remote host</h2>
<div class="outline-text-2" id="text-1">
<p>
In order to enable remote debug, the debug machine (developer machine)
need to be accessible directly from the xdebug server. Xdebug, when inited from
the browser, on the server side, will init the debug session to the
remote/port specified in php.ini.
</p>

<p>
When the developer machine resides inside the router, the remote
machine nomally won't be able to talk directly ot it.
</p>

<p>
To enable the above debug scenario:
x- Using ssh's remote forward to forward the xdebug port to local
  machine (developer machine)
</p>
<ul class="org-ul">
<li>in php.ini, enable xdebug:
<p class="verse">
xdebug.enable=1<br>
xdebug.remote<sub>enable</sub>=1<br>
xdebug.idekey="PHPSTORM"<br>
xdebug.remote<sub>host</sub>=127.0.0.1<br>
xdebug.remote<sub>port</sub>=9000<br></p>
<p>
where the remote<sub>host</sub> and remote<sub>port</sub> will be the address in the ssh
remote forword, xdebug will use this to communicate with the
developer machine.
</p>
</li>
<li>in nginx config for hhvm/php fasgcgi, set:
<p class="verse">
fastcgi<sub>read</sub><sub>timeout</sub> 600;<br></p>
<p>
to prevent gateway timetout while in the debug session.
</p>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">include/require</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>
<code>include()</code> will through a warning if it cannot include the file, but
the rest of the script will run. <code>require()</code> will throw an error and
halt the script if it cannot include the file.
</li>
<li>File are included based on the file path given, or if none is
given, the <span class="underline">include<sub>path</sub></span> specified.
</li>
<li>If the file isn't found in the <span class="underline">include<sub>path</sub></span>, <code>include</code> will
finaly check the calling script's <b>own directory</b> and the <b>current
working directory</b> before falling.
</li>
<li>If a path is defined, either alsolute or relative, <span class="underline">include<sub>path</sub></span>
    will be ignored.
</li>
<li>when a file is include, the code it contains inherits the
<b>variable scope</b> of the line on which the include occurs. However,
all functions and classes defined in the included file have the
<b>global scope</b>.
</li>
<li>If "URL include wrappers" are enabled in PHP, you can specify the
file to  be included using a URL (via HTTP or other supported
wrapper):
<div class="highlight"><pre><span></span>include 'http://www.example.com/file.txt?foo=1&amp;bar=2'
</pre></div>
<p>
It also possbile to include a string as a filename using the
<code>data</code> wrapper:
</p>
<div class="highlight"><pre><span></span>//get content
$cFile = file_get_contents('crypted.file');
//decrypt the content
$content = decrypte($cFile);

//include this
include("data://text/plain;base64,".base64_encode($content));
//or
include("data://text/plain,".urlencode($content));
</pre></div>
</li>
<li>Using $<sub>SERVER['DOCUMENT</sub><sub>ROOT']</sub>:
<div class="highlight"><pre><span></span>include $_SERVER['DOCUMENT_ROOT']."/lib/sample.lib.php";
</pre></div>
<p>
so the script can be move anyehere in the project without changes.
</p>
</li>
<li>If file A includes file B, and B includes file C; the include path
in B should take into account that A, not B, is the active working
directory.
</li>
<li>To avoid issues caused by the above, as a rule of thumb, never
include files using relative paths:
<div class="highlight"><pre><span></span>&lt;?php // prepend.php - autoprepended at the top of your tree
define('MAINDIR',dirname(__FILE__) . '/');
define('DL_DIR',MAINDIR . 'downloads/');
define('LIB_DIR',MAINDIR . 'lib/');

require_once(LIB_DIR . 'excel_functions.php');
</pre></div>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Namespace</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Inside a namespace, when PHP encouters an unqualified Name in a
class name, function or constant context, it resolves with
different priorities:
<ul class="org-ul">
<li>Class names always resolve to the current namespace name. For
example, to refrence <code>Exception</code> in a namespace, will need to
qualified it as <code>\Exception</code>.
</li>
<li>Function and constants, PHP will fall back to global functions
or constants if a namespaced function or constant does not exist.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Anonymous functions and Clousures</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Anonymous functions are implemented using the <code>Closure</code> class. It
is converted into instances of the <code>Closure</code>;
</li>
<li>Closures may also inherit variables from the parent scope. Any
such variables must be passed to the <code>use</code> language construct:
<div class="highlight"><pre><span></span>$message = 'hello';
$example = function () use ($message) {
    var_dump($message);
};
</pre></div>
</li>
<li>Note that when use <code>use</code> to import variable inside closure's
scope, the variable is actually being <b>copied</b> into the closure's
scope, rather than just being make available.
<div class="highlight"><pre><span></span>$result = 0;
$three = function() use (&amp;$result){
    var_dump($result);
};
$result++;
$three();
</pre></div>
</li>
<li>Inheriting variables from the parent scope is not the same as
using global variables. Global variables exist in the global
scope, which is the same no matter what function is executing.
</li>
<li>When anonymous functions are declared in the context of a class,
the current class is automatically bound to it, making <code>$this</code>
available inside of the function's scope.
</li>
<li>If automatic binding of the current class is not wanted, then
<i>static anonymous function</i> may be used:
<div class="highlight"><pre><span></span>new class {
    function __construct()
    {
	(static function() {
	    var_dump($this); //$this will be undefined here.
	}();
    }
};
</pre></div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Logging with Monolog</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>By default, Monolog will use the <code>\Monolog\Handler\StreamHandler</code>
    to log to the standard error output.
</li>
<li>Multiple handler can be set with different log level.
<div class="highlight"><pre><span></span>$browserHanlder = new \Monolog\Handler\BrowserConsoleHandler(\Monolog\Logger::INFO);
$streamHandler = new \Monolog\Handler\StreamHandler('php://stderr', \Monolog\Logger::ERROR);
</pre></div>
<p>
The <code>BrowserConsoleHandler</code> log the messages to the browser's console.
</p>
</li>
<li>There is a bubbling option to allow handler to bubble up the log
messages to above handlers.
</li>
<li>Monolog provides two different ways to add <i>extra information</i>
    along the simple textual message:
<ul class="org-ul">
<li>
<b>logging context</b>:
<div class="highlight"><pre><span></span>$logger-&gt;info('Adding a new user', array('username' =&gt; 'Seldaek'));
</pre></div>
</li>
<li>
<b>Preprocessors</b>: useful for adding more details to your log. For
example, the <code>WebProcessor</code> adds more details about the request,
like url, ip, etc:
<div class="highlight"><pre><span></span>$logger-&gt;pushProcessor(new \Monolog\Processor\WebProcessor);
$browserHanlder = new \Monolog\Handler\BrowserConsoleHandler(\Monolog\Logger::INFO);
$logger-&gt;pushHandler($browserHanlder);
</pre></div>
</li>
</ul>
</li>
<li>Using channels to identify which part of the application a log is related:
<div class="highlight"><pre><span></span> // Create the main logger of the app
$logger = new Logger('my_logger');
// clone the first one to only change the channel
$securityLogger = $logger-&gt;withName('security');
</pre></div>
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/php/" rel="tag">php</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../programming-note/" rel="prev" title="Programming Notes">Previous post</a>
            </li>
            <li class="next">
                <a href="../microservices-note/" rel="next" title="Microservices Note">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:n.tesla@example.com">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
